[{
  "_id": {
    "$oid": "6276353218c78a7b0472ee49"
  },
  "title": "Macarons",
  "cover": "https://res.cloudinary.com/dq36wdmed/image/upload/v1649510728/Macrons_f1a0a84604.jpg",
  "body": "**Ingredients**\nfor 30 macarons\n- 3. 1 ¾ cups powdered sugar(210 g)\n- 4. 1 cup almond flour(95 g), finely ground\n- 5. 1 teaspoon salt, divided\n- 6. 3 egg whites, at room temperature\n- 7. ¼ cup granulated sugar(50 g)\n- 8. ½ teaspoon vanilla extract\n- 9. 2 drops pink gel food coloring\n\n**Preparation**\n1. Make the macarons: In the bowl of a food processor, combine the powdered sugar, almond flour, and ½ teaspoon of salt, and process on low speed, until extra fine. Sift the almond flour mixture through a fine-mesh sieve into a large bowl.\n2. In a separate large bowl, beat the egg whites and the remaining ½ teaspoon of salt with an electric hand mixer until soft peaks form. Gradually add the granulated sugar until fully incorporated. Continue to beat until stiff peaks form (you should be able to turn the bowl upside down without anything falling out).\n3. Add the vanilla and beat until incorporated. Add the food coloring and beat until just combined.\n4. Add about ⅓ of the sifted almond flour mixture at a time to the beaten egg whites and use a spatula to gently fold until combined. After the last addition of almond flour, continue to fold slowly until the batter falls into ribbons and you can make a figure 8 while holding the spatula up.\n5. Transfer the macaron batter into a piping bag fitted with a round tip.\n6. Place 4 dots of the batter in each corner of a rimmed baking sheet, and place a piece of parchment paper over it, using the batter to help adhere the parchment to the baking sheet.\n7. Pipe the macarons onto the parchment paper in 1½-inch (3-cm) circles, spacing at least 1-inch (2-cm) apart.\n8. Tap the baking sheet on a flat surface 5 times to release any air bubbles.\n9. Let the macarons sit at room temperature for 30 minutes to 1 hour, until dry to the touch.\n10. Preheat the oven to 300˚F (150˚C).\n11. Bake the macarons for 17 minutes, until the feet are well-risen and the macarons don’t stick to the parchment paper.\n12. Transfer the macarons to a wire rack to cool completely before filling.\n13. Make the buttercream: In a large bowl, add the butter and beat with a mixer for 1 minute until light and fluffy. Sift in the powdered sugar and beat until fully incorporated. Add the vanilla and beat to combine. Add the cream, 1 tablespoon at a time, and beat to combine, until desired consistency is reached.\n14. Transfer the buttercream to a piping bag fitted with a round tip.\n15. Add a dollop of buttercream to one macaron shell. Top it with another macaron shell to create a sandwich. Repeat with remaining macaron shells and buttercream.\n16. Place in an airtight container for 24 hours to “bloom”.\n19. Enjoy!",
  "description": "Such a good recipe! Only thing I’d do next time is a little less sugar in the frosting because personally it was just too sweet for me, but overall I was SO happy with the end result!! ❤️",
  "tags": [],
  "comments": []
},{
  "_id": {
    "$oid": "62763c0518c78a7b0472ee4b"
  },
  "title": "Kanafa",
  "cover": "https://res.cloudinary.com/dq36wdmed/image/upload/v1649511128/kanafa_image_cd73e5b2ff.jpg",
  "body": "Ingredients\n\n- 1 (16 ounce) box shredded phyllo dough (kataifi)\n- 1 (15 ounce) container ricotta cheese\n- 1 cup shredded mozzarella cheese\n- ⅓ cup white sugar\n- 12 ounces unsalted butter\n\nFor the syrup:\n- 1 cup white sugar\n- ½ cup water\n- 1 teaspoon lemon juice\n- ⅛ teaspoon rose water (Optional)\n\nDirections\n1. Preheat an oven to 400 degrees F (200 degrees C).\n2. Use a food processor to finely chop the frozen, shredded phyllo dough. The strands should be about the size of a grain of rice. Pour the dough into a large mixing bowl. In a separate bowl, mix together the ricotta, mozzarella, and 1/3 cup sugar.\n3. Place the butter in a large liquid measuring cup or bowl with a spout. Heat the butter in a microwave until completely melted, and let it sit for several minutes until a thick white foam has formed on top. Clarify the butter by using a spoon to skim off the foam.\n4. Carefully pour the butter into the bowl of phyllo dough. Avoid pouring in the white milk solids at the bottom of the clarified butter. Use your hands to mix the butter and dough together. Make sure that the butter is absorbed by taking handfuls of the dough and rubbing it between your palms.\n5. Evenly spread the buttered phyllo dough into a 9x13-inch pan and firmly press it into the bottom and edges. Spread the cheese mixture onto the dough, avoiding the edges of the pan.\n6. Bake in the preheated oven until the cheese is slightly golden and the edges of dough are brown and bubbly, 30 to 35 minutes.\n7. While the kanafa is baking, prepare the syrup. Combine the water and 1/2 cup sugar in a small saucepan. Bring the mixture to a boil over medium-high heat. Reduce the heat to medium and stir in the lemon juice. Simmer, stirring constantly, until the sugar is dissolved and the mixture is thickened, 5 to 7 minutes. (Do not let the mixture turn golden and caramelize.) Remove from heat and add the rose water; set aside.\n8. Remove the kanafa from the oven. Place a large platter or baking sheet over the baking dish. Using oven mitts, carefully invert the baking dish onto the platter so the phyllo is on top. Pour the syrup over the kanafa. Cut into pieces and serve while hot.\n",
  "description": "A favorite Palestinian dessert! Crunchy shredded phyllo dough is baked with a layer of creamy sweet cheese and then drenched in rosewater syrup. It's simple yet impressive. The cheese filling is traditionally made from Nabulsi cheese that is desalted.",
  "tags": [],
  "comments": []
},{
  "_id": {
    "$oid": "6288e50b15007c3cff408040"
  },
  "title": "Best Chewy Chocolate Chip Cookies",
  "cover": "https://res.cloudinary.com/dq36wdmed/image/upload/v1649510158/cookies_image_693a7e5e32.jpg",
  "body": "Ingredients\n- for 12 cookies\n- ½ cup granulated sugar(100 g)\n- ¾ cup brown sugar(165 g), packed\n- 1 teaspoon salt\n- ½ cup unsalted butter(115 g), melted\n- 1 egg\n- 1 teaspoon vanilla extract\n- 1 ¼ cups all-purpose flour(155 g)\n- ½ teaspoon baking soda\n- 4 oz milk or semi-sweet chocolate chunks(110 g)\n- 4 oz dark chocolate chunk(110 g), or your preference\n\nPreparation\n1. In a large bowl, whisk together the sugars, salt, and butter until a paste forms with no lumps.\n2.  Whisk in the egg and vanilla, beating until light ribbons fall off the whisk and remain for a short while before falling back into the mixture.\n3.Sift in the flour and baking soda, then fold the mixture with a spatula (Be careful not to overmix, which would cause the gluten in the flour to toughen resulting in cakier cookies).\n4.Fold in the chocolate chunks, then chill the dough for at least 30 minutes. For a more intense toffee-like flavor and deeper color, chill the dough overnight. The longer the dough rests, the more complex its flavor will be.\n5.Preheat oven to 350°F (180°C). Line a baking sheet with sheet with parchment paper.\n6.Scoop the dough with an ice-cream scoop onto a parchment paper-lined baking sheet, leaving at least 4 inches (10 cm) of space between cookies and 2 inches (5 cm) of space from the edges of the pan so that the cookies can spread evenly.\n7.Bake for 12-15 minutes, or until the edges have started to barely brown.\n8.Cool completely before serving.\n9.Enjoy!\n\n",
  "description": "There are a few secrets to the best classic, chewy chocolate chip cookies. Number one: Don’t use chips; instead, opt for a mix of milk or semisweet and dark chocolate chunks.",
  "tags": [],
  "comments": []
},{
  "_id": {
    "$oid": "6288e4f424ed8a4138f69bed"
  },
  "title": "3-Ingredient Hazelnut Brownies",
  "body": "**Ingredients**\n-  for 8 servings\n-   13 oz chocolate hazelnut spread(370 g)\n-  2 eggs\n-  ½ cup flour(65 g)\n\n **Preparation**\n1. Preheat oven to 350ºF (175ºC).\n2. In a large bowl, combine ingredients.\n3. Transfer mix to square baking dish.\n4. Bake for 15 minutes.\n5. Allow to cool for 5 minutes and then carefully cut into squares.\n6. Enjoy!",
  "cover": "https://res.cloudinary.com/dq36wdmed/image/upload/v1650700785/chocolate_brownies_85878429ba.jpg",
  "description": "This is my absolute favorite brownie recipe. They are rich, fudgy in the middle, and made completely from scratch. These brownies are so much better than the box, and I bet you have what you need to make them already sitting in your kitchen.",
  "tags": [],
  "comments": []
},{
  "_id": {
    "$oid": "6288e60915007c3cff408042"
  },
  "title": "Fluffy Pancakes",
  "cover": "https://res.cloudinary.com/dq36wdmed/image/upload/v1649510011/pancakes_natural_light_maha_munaf_04671f5cbc.jpg",
  "body": "**Ingredients**\n**for 4 pancakes**\n\n- 4 cups flour(500 g), sifted\n- 4 tablespoons baking powder\n- 4 cups milk(960 mL), warm to the touch\n- ¾ cup butter(170 g), melted\n- 3 egg yolks\n- 4 egg whites\n- maple syrup, to serve\n\n**Preparation**\n1. Whisk together the flour and baking powder in a large bowl.\n2. In a separate bowl, add the butter, milk, and egg yolks, stirring to combine.\n3. In a third bowl, use a hand mixer to beat the egg whites until soft peaks form.\n4. Pour the milk mixture into the flour mixture and stir with rubber spatula until just combined. Add the beaten egg whites and gently fold to combine.\n5. Heat an 8-inch (20cm) nonstick skillet over low heat. Pour 1 ½ cups of pancake batter into the skillet, smooth out the top, then cover with a lid. Cook until golden brown on the bottom and a toothpick inserted into the center comes out clean, about 20 minutes. Transfer the pancake to a plate and repeat, making 3 more pancakes with the remaining batter.\n6. Serve with maple syrup.\n7. Enjoy!\n",
  "description": "Nailed it!!!!! Followed the recipe and it came out wonderful\nDon't forget the sugar. It was really tasteless without the sugar. Hoped I helped someone😃❤️",
  "tags": [],
  "comments": []
}]